3D/exp3/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    data1875
    {
        type    uniform;
        axis    y;
        start   (0.38625 0 0.1);
        end     (0.38625 0.1648 0.1);
        nPoints 26;
    }

    data125
    {
        type    uniform;
        axis    y;
        start   (0.2575 0 0.1);
        end     (0.2575 0.1648 0.1);
        nPoints 26;
    }
);

fields          (alpha.water);

// ************************************************************************* //
